[{"head":{"id":"31443268","title":"Reply to \"When Is a Ketogenic Diet Ketogenic? Comment on Satiating Effect of a Ketogenic Diet and Its Impact on Muscle Improvement and Oxidation State in Multiple Sclerosis Patients. Nutrients 2019, 11, 1156\".","xmlFullTextDownloadLink":"https://www.ebi.ac.uk/europepmc/webservices/rest/31443268/fullTextXML","recommendation":"coconut oil","impacted":"brain improving"},"backsUpClaim":"y","body":"2. Our goal was to administer coconut oilinthe diet as the main source of fat, since it is a substance that presents a large amount of medium-chain fatty acids (MCFAs), which are absorbed and metabolized more quickly and efficiently than long-chain fatty acids (LCFAs) [5]. Furthermore, as previously stated, through the administration of this oil, a ketogenic state is produced with respect to the beginning of the study, asthe ketones representan alternative brain fuel to glucose [6]. Moreover, it has been shown that the intake of coconut oil may improve brain health by directly activating ketogenesis in astrocytes and, thereby by providing fuel to neighboring neurons [7]. This fact means that, regardless of the ketone values in blood, coconut oil is the best alternative in order to reach this brain ketogenesis, with enormous resulting potential benefits in neurodegenerative diseases in general, and in MS in particular in neurodegenerative diseases in general, and in Multiple Sclerosis (MS) in particular. In addition, our amounts of coconut oil were very high (60 mL/day divided into two 30 mL doses), so we believe that our results are not comparable to those in the reference indicated by Dr. Klement, where 20 mL were administered daily.","correlationScore":84.99181818181819},{"head":{"id":"31998450","title":"Diet therapy for the treatment of Alzheimer's disease in view of traditional Persian medicine: A review.","xmlFullTextDownloadLink":"https://www.ebi.ac.uk/europepmc/webservices/rest/31998450/fullTextXML","recommendation":"coconut oil","impacted":"brain improving"},"backsUpClaim":"y","body":"Brains of ovariectomised rats can display features similar to those observed in menopausal women with AD. Radenahmad et al. investigated the effects of young coconut juice on the pathological alterations occur in the brains of AD ovariectomised rats. Four groups of rats included sham-operated, ovariectomised, ovariectomised +oestradiol benzoate and ovariectomised + coconut juice. Brain sections were immunostained with Aβ1–42, glial fibrillary acidic protein (GFAP) (an intermediate neurofilament of astrocytes) and Tau-1 antibodies which are reliable biomarkers of amyloidosis, astrogliosis and tauopathy. The results showed that coconut treatment restored the serum oestradiol to levels significantly higher than that of the ovariectomised and sham groups. Aβ deposition and GFAP expression was significantly reduced in the cerebral cortex of the coconut-treated animals, as compared with the other groups. Tau-1 expression was also suppressed in the hippocampus (51).","correlationScore":84.99181818181819},{"head":{"id":"32290535","title":"Mediterranean Diet Nutrients to Turn the Tide against Insulin Resistance and Related Diseases.","xmlFullTextDownloadLink":"https://www.ebi.ac.uk/europepmc/webservices/rest/32290535/fullTextXML","recommendation":"coconut oil","impacted":"brain improving"},"backsUpClaim":"y","body":"PPARγ belongs to a nuclear hormone receptor superfamily of ligand-inducible transcription factors that heterodimerize with the retinoid X receptor (RXR) [108] and bind to peroxisome proliferator response elements (PPREs) in the promoter region of target genes [109]. Although present in most cell types, such as vessels, neurons, macrophages, microglia and astrocytes, in which it attenuates the expression of proinflammatory mediators [110], PPARγ is predominantly expressed in adipocytes, wherein modulates lipid metabolism in form of release, transport, and storage of free fatty acids (FFAs) [111,112]. By enhancing the uptake and storage of FFAs in adipose tissue, PPARγ agonists may decrease ectopic fat accumulation [113], thus preserving non-adipose peripheral tissues from the wide range of lipotoxicity complications, including IR, liver steatosis, hyperglycemia and CVD [114]. However, peripheral IR is strongly related to brain dysfunction, either due to reduced insulin transport into the brain [115] or to altered local insulin receptor sensitivity and activation [116]. Notwithstanding a marginal role in neuronal glucose uptake under basal conditions, as it mostly occurs in an insulin-independent manner, insulin positively regulates the normal brain function, particularly by enhancing the spatial working memory via the insulin-sensitive glucose transporter GLUT-4 [117]. In line with these considerations, cyanidin-3-O-glucopyranoside, by acting as a potent natural agonist for PPARγ with peripheral and central insulin-sensitizing effects, has been shown not only to reduce liver fat [118] and fasting glucose concentrations [107] of treated animals, but also to increase cerebral glucose uptake [107]. Furthermore, promising clinical results about the impact of anthocyanin consumption in elderly individuals with mild cognitive impairment has emerged recently. In these patients, the dietary introduction of a daily anthocyanin-rich fruit juice significantly improved verbal fluency, as well as short-term and long-term memory, over a 12-week period [119], which is consistent with other reports [120,121]. Nonetheless, it cannot be excluded that some benefits on cognitive processes may have been caused by detrimental effects of nutritional deficiencies in control subjects, rather than the surplus consumption of anthocyanins in interventional groups. However, the incorporation of functional beverages into normal dietary patterns might still be a practical and convenient strategy to increase the daily intake of phytochemicals with insulin sensitivity-promoting effects in the general population, closing the gap between the actual vegetable intake and clinical recommendations [122]. On a different note, the beneficial cognitive effects of the MedDiet in elderly patients with dementia may be augmented by the isocaloric dietary supplementation of medium-chain saturated fatty acids in the form of coconut oil, which correlates with an immediate increase of circulating ketone bodies [123]. Brain exposure to ketone bodies can replace the brain’s normal reliance on glucose and potentially reverse the pathological alterations of Alzheimer’s disease, ultimately improving the cognitive performances in affected patients, with a greater impact on women than men, after only 21 days of coconut oil supplementation [123].","correlationScore":71.79848484848485}]